recipes-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "foo"], ["password_digest", "$2a$10$Z8A0ALWaYqlu1eIVlAIpvefPeBSiv3I/q6WV.QepDBNWcYIEmOjyS"], ["created_at", "2017-11-06 05:58:24.545830"], ["updated_at", "2017-11-06 05:58:24.545830"]]
---
  def create
    p "*" * 100
    p params["email"]
    p params["password"]
    p "*" * 100
    # if @user.save
    #   json_response({ anson: 'nice' })
    # else
    #   json_response({ anson: 'not nice' })
    # end


    @user = User.create!(email: params["email"], password: params["password"])